{
  "bard": {
    "lore": {
      "name": "College of Lore",
      "description": "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales.",
      "features": [
        {
          "level": 3,
          "name": "Bonus Proficiencies",
          "description": "You gain proficiency with three skills of your choice."
        },
        {
          "level": 3,
          "name": "Cutting Words",
          "description": "When a creature you can see within 60 feet makes an attack roll, ability check, or damage roll, you can use your reaction to expend one Bardic Inspiration die and subtract it from their roll."
        },
        {
          "level": 6,
          "name": "Additional Magical Secrets",
          "description": "Learn two spells of your choice from any class. These count as bard spells but don't count against your spells known."
        },
        {
          "level": 14,
          "name": "Peerless Skill",
          "description": "When you make an ability check, you can expend one use of Bardic Inspiration to add the die to your roll (after rolling but before knowing success/failure)."
        }
      ]
    },
    "valor": {
      "name": "College of Valor",
      "description": "Bards of the College of Valor are daring skalds whose tales keep alive the memory of the great heroes of the past, inspiring a new generation of heroes.",
      "features": [
        {
          "level": 3,
          "name": "Bonus Proficiencies",
          "description": "You gain proficiency with medium armor, shields, and martial weapons."
        },
        {
          "level": 3,
          "name": "Combat Inspiration",
          "description": "A creature with a Bardic Inspiration die can add it to a weapon damage roll or add it to their AC against one attack (as a reaction)."
        },
        {
          "level": 6,
          "name": "Extra Attack",
          "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
        },
        {
          "level": 14,
          "name": "Battle Magic",
          "description": "When you use your action to cast a bard spell, you can make one weapon attack as a bonus action."
        }
      ]
    },
    "glamour": {
      "name": "College of Glamour",
      "description": "The College of Glamour is the home of bards who mastered their craft in the vibrant realm of the Feywild or under the tutelage of someone who dwelled there.",
      "features": [
        {
          "level": 3,
          "name": "Mantle of Inspiration",
          "description": "As a bonus action, expend one Bardic Inspiration to grant up to 5 creatures temporary HP and let them use their reaction to move up to their speed without provoking opportunity attacks."
        },
        {
          "level": 3,
          "name": "Enthralling Performance",
          "description": "Perform for at least 1 minute to charm humanoids. Charmed targets idolize you and hinder those opposing you (Wisdom save to resist)."
        },
        {
          "level": 6,
          "name": "Mantle of Majesty",
          "description": "As a bonus action, cast Command without a spell slot. You can do this each turn for 1 minute. Once used, can't use again until long rest."
        },
        {
          "level": 14,
          "name": "Unbreakable Majesty",
          "description": "As a bonus action, assume a magically majestic presence for 1 minute. Creatures attacking you must make Charisma saves or choose a new target."
        }
      ]
    },
    "swords": {
      "name": "College of Swords",
      "description": "Bards of the College of Swords are called blades, entertaining through weapon prowess. They perform stunts such as sword swallowing, knife throwing, and juggling.",
      "features": [
        {
          "level": 3,
          "name": "Bonus Proficiencies",
          "description": "You gain proficiency with medium armor and scimitars. Using a weapon as your spellcasting focus for bard spells."
        },
        {
          "level": 3,
          "name": "Fighting Style",
          "description": "Choose Dueling or Two-Weapon Fighting style."
        },
        {
          "level": 3,
          "name": "Blade Flourish",
          "description": "When you take the Attack action, your walking speed increases by 10 feet and you can expend Bardic Inspiration for special flourishes: Defensive (+die to AC), Slashing (deal die damage to nearby creature), or Mobile (+die to damage, push target)."
        },
        {
          "level": 6,
          "name": "Extra Attack",
          "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
        },
        {
          "level": 14,
          "name": "Master's Flourish",
          "description": "When you use a Blade Flourish, you can roll a d6 and use it instead of expending a Bardic Inspiration die."
        }
      ]
    },
    "whispers": {
      "name": "College of Whispers",
      "description": "Bards of the College of Whispers use their knowledge and magic to uncover secrets and turn them against others through extortion and threats.",
      "features": [
        {
          "level": 3,
          "name": "Psychic Blades",
          "description": "When you hit with a weapon attack, you can expend one Bardic Inspiration to deal extra psychic damage equal to a roll of that die."
        },
        {
          "level": 3,
          "name": "Words of Terror",
          "description": "Speak privately with a humanoid for 1 minute to frighten them for 1 hour or until harmed. Target believes you know their darkest secret (Wisdom save to resist)."
        },
        {
          "level": 6,
          "name": "Mantle of Whispers",
          "description": "When a humanoid dies within 30 feet, you can capture its shadow as a reaction. You can use the shadow to assume the dead creature's appearance and knowledge for 1 hour."
        },
        {
          "level": 14,
          "name": "Shadow Lore",
          "description": "Weave magic to magically charm a creature. The charmed target obeys your commands for 8 hours (Wisdom save to resist)."
        }
      ]
    },
    "creation": {
      "name": "College of Creation",
      "description": "Bards of the College of Creation believe the cosmos is a work of art—the creation of the first dragons and gods. That creative work included harmonies that continue to resound through existence today.",
      "features": [
        {
          "level": 3,
          "name": "Mote of Potential",
          "description": "When you give a creature a Bardic Inspiration die, you can utter notes from the Song of Creation to create a Mote of Potential, granting additional benefits when the die is used."
        },
        {
          "level": 3,
          "name": "Performance of Creation",
          "description": "As an action, create one nonmagical item worth up to 20 times your bard level in gold (must fit in a 5-foot cube). Item disappears after a number of hours equal to your proficiency bonus."
        },
        {
          "level": 6,
          "name": "Animating Performance",
          "description": "As an action, animate a Large or smaller nonmagical item, turning it into a Dancing Item creature under your control for 1 hour."
        },
        {
          "level": 14,
          "name": "Creative Crescendo",
          "description": "When you use Performance of Creation, you can create more than one item and the maximum value increases. You can create multiple nonmagical items simultaneously."
        }
      ]
    },
    "eloquence": {
      "name": "College of Eloquence",
      "description": "Bards of this college master the art of oratory. Persuasion is regarded as a high art, and a well-reasoned, well-spoken argument often proves more persuasive than facts.",
      "features": [
        {
          "level": 3,
          "name": "Silver Tongue",
          "description": "When you make a Charisma (Persuasion) or Charisma (Deception) check, you can treat a d20 roll of 9 or lower as a 10."
        },
        {
          "level": 3,
          "name": "Unsettling Words",
          "description": "As a bonus action, expend a Bardic Inspiration die to subtract it from a creature's next saving throw within the next minute."
        },
        {
          "level": 6,
          "name": "Unfailing Inspiration",
          "description": "When a creature uses your Bardic Inspiration and fails, they can keep the die."
        },
        {
          "level": 6,
          "name": "Universal Speech",
          "description": "You can make any creature understand your speech. A number of times equal to your Charisma modifier (minimum once), you can choose creatures to always understand you."
        },
        {
          "level": 14,
          "name": "Infectious Inspiration",
          "description": "When a creature uses your Bardic Inspiration and succeeds, you can use your reaction to grant Bardic Inspiration to another creature within 60 feet (without expending a use)."
        }
      ]
    }
  },
  "wizard": {
    "abjuration": {
      "name": "School of Abjuration",
      "description": "The School of Abjuration emphasizes magic that blocks, banishes, or protects. Detractors of this school say that its tradition is about denial, negation, and preventing things from happening. Abjurers, however, understand that protection is not a passive state, but an active and sometimes violent one.",
      "features": [
        {
          "level": 2,
          "name": "Abjuration Savant",
          "description": "The gold and time you must spend to copy an abjuration spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Arcane Ward",
          "description": "When you cast an abjuration spell of 1st level or higher, you can simultaneously use a strand of the spell's magic to create a magical ward on yourself that lasts until you finish a long rest. The ward has hit points equal to twice your wizard level + your Intelligence modifier. Whenever you take damage, the ward takes the damage instead. If this damage reduces the ward to 0 hit points, you take any remaining damage."
        },
        {
          "level": 6,
          "name": "Projected Ward",
          "description": "When a creature that you can see within 30 feet of you takes damage, you can use your reaction to cause your Arcane Ward to absorb that damage. If this damage reduces the ward to 0 hit points, the warded creature takes any remaining damage."
        },
        {
          "level": 10,
          "name": "Improved Abjuration",
          "description": "When you cast an abjuration spell that requires you to make an ability check as a part of casting the spell (as in counterspell and dispel magic), you add your proficiency bonus to that ability check."
        },
        {
          "level": 14,
          "name": "Spell Resistance",
          "description": "You have advantage on saving throws against spells and other magical effects."
        }
      ]
    },
    "conjuration": {
      "name": "School of Conjuration",
      "description": "As a conjurer, you favor spells that produce objects and creatures out of thin air. You can pull weapons from the ether, summon creatures of all shapes and sizes, and even teleport yourself across vast distances or planes of existence.",
      "features": [
        {
          "level": 2,
          "name": "Conjuration Savant",
          "description": "The gold and time you must spend to copy a conjuration spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Minor Conjuration",
          "description": "You can use your action to conjure up an inanimate object in your hand or on the ground in an unoccupied space that you can see within 10 feet of you. This object can be no larger than 3 feet on a side and weigh no more than 10 pounds, and its form must be that of a nonmagical object that you have seen. The object is visibly magical, radiating dim light out to 5 feet."
        },
        {
          "level": 6,
          "name": "Benign Transposition",
          "description": "You can use your action to teleport up to 30 feet to an unoccupied space that you can see. Alternatively, you can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, you both teleport, swapping places."
        },
        {
          "level": 10,
          "name": "Focused Conjuration",
          "description": "While you are concentrating on a conjuration spell, your concentration can't be broken as a result of taking damage."
        },
        {
          "level": 14,
          "name": "Durable Summons",
          "description": "Any creature that you summon or create with a conjuration spell has 30 temporary hit points."
        }
      ]
    },
    "divination": {
      "name": "School of Divination",
      "description": "The counsel of a diviner is sought by royalty and commoners alike, for all seek a clearer understanding of the past, present, and future. As a diviner, you strive to part the veils of space, time, and consciousness so that you can see clearly. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight.",
      "features": [
        {
          "level": 2,
          "name": "Divination Savant",
          "description": "The gold and time you must spend to copy a divination spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Portent",
          "description": "When you finish a long rest, roll two d20s and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn."
        },
        {
          "level": 6,
          "name": "Expert Divination",
          "description": "When you cast a divination spell of 2nd level or higher using a spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the spell you cast and can't be higher than 5th level."
        },
        {
          "level": 10,
          "name": "The Third Eye",
          "description": "You can use your action to increase your powers of perception. When you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a short or long rest. You can't use the feature again until you finish a rest."
        },
        {
          "level": 14,
          "name": "Greater Portent",
          "description": "You roll three d20s for your Portent feature, rather than two."
        }
      ]
    },
    "enchantment": {
      "name": "School of Enchantment",
      "description": "As a member of the School of Enchantment, you have honed your ability to magically entrance and beguile other people and monsters. Some enchanters are peacemakers who bewitch the violent to lay down their arms and charm the cruel into showing mercy. Others are tyrants who magically bind the unwilling into their service. Most enchanters fall somewhere in between.",
      "features": [
        {
          "level": 2,
          "name": "Enchantment Savant",
          "description": "The gold and time you must spend to copy an enchantment spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Hypnotic Gaze",
          "description": "Your soft words and enchanting gaze can magically enthrall another creature. As an action, choose one creature that you can see within 5 feet of you. If the target can see or hear you, it must succeed on a Wisdom saving throw against your wizard spell save DC or be charmed by you until the end of your next turn."
        },
        {
          "level": 6,
          "name": "Instinctive Charm",
          "description": "When a creature you can see within 30 feet of you makes an attack roll against you, you can use your reaction to divert the attack, provided that another creature is within the attack's range. The attacker must make a Wisdom saving throw against your wizard spell save DC. On a failed save, the attacker must target the creature that is closest to it, not including you or itself."
        },
        {
          "level": 10,
          "name": "Split Enchantment",
          "description": "When you cast an enchantment spell of 1st level or higher that targets only one creature, you can have it target a second creature."
        },
        {
          "level": 14,
          "name": "Alter Memories",
          "description": "You gain the ability to make a creature unaware of your magical influence on it. When you cast an enchantment spell to charm one or more creatures, you can alter one creature's understanding so that it remains unaware of being charmed."
        }
      ]
    },
    "evocation": {
      "name": "School of Evocation",
      "description": "You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, while some seek their own gain as bandits, adventurers, or aspiring tyrants.",
      "features": [
        {
          "level": 2,
          "name": "Evocation Savant",
          "description": "The gold and time you must spend to copy an evocation spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Sculpt Spells",
          "description": "You can protect some creatures from the effect of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save."
        },
        {
          "level": 6,
          "name": "Potent Cantrip",
          "description": "Your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip."
        },
        {
          "level": 10,
          "name": "Empowered Evocation",
          "description": "You can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast."
        },
        {
          "level": 14,
          "name": "Overchannel",
          "description": "You can increase the power of your simpler spells. When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell."
        }
      ]
    },
    "illusion": {
      "name": "School of Illusion",
      "description": "You focus your studies on magic that dazzles the senses, befuddles the mind, and tricks even the wisest folk. Your magic is subtle, but the illusions crafted by your keen mind make the impossible seem real. Some illusionists—including many gnome wizards—are benign tricksters who use their spells to entertain. Others are more sinister, using their deceptions to frighten and fool others for their personal gain.",
      "features": [
        {
          "level": 2,
          "name": "Illusion Savant",
          "description": "The gold and time you must spend to copy an illusion spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Improved Minor Illusion",
          "description": "When you cast minor illusion, you can create both a sound and an image with a single casting of the spell."
        },
        {
          "level": 6,
          "name": "Malleable Illusions",
          "description": "When you cast an illusion spell that has a duration of 1 minute or longer, you can use your action to change the nature of that illusion (using the spell's normal parameters for the illusion), provided that you can see the illusion."
        },
        {
          "level": 10,
          "name": "Illusory Self",
          "description": "When a creature makes an attack roll against you, you can use your reaction to interpose an illusory duplicate of yourself between the attacker and yourself. The attack automatically misses, and the illusion dissipates."
        },
        {
          "level": 14,
          "name": "Illusory Reality",
          "description": "When you cast an illusion spell of 1st level or higher, you can choose one inanimate, nonmagical object that is part of the illusion and make that object real. You can do this on your turn as an action while the spell lasts."
        }
      ]
    },
    "necromancy": {
      "name": "School of Necromancy",
      "description": "The School of Necromancy explores the cosmic forces of life, death, and undeath. As you focus your studies in this tradition, you learn to manipulate the energy that animates all living things. As you progress, you learn to sap the life force from a creature as your magic destroys its body, transforming that vital energy into magical power you can manipulate.",
      "features": [
        {
          "level": 2,
          "name": "Necromancy Savant",
          "description": "The gold and time you must spend to copy a necromancy spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Grim Harvest",
          "description": "You gain the ability to reap life energy from creatures you kill with your spells. Once per turn when you kill one or more creatures with a spell of 1st level or higher, you regain hit points equal to twice the spell's level, or three times its level if the spell belongs to the School of Necromancy."
        },
        {
          "level": 6,
          "name": "Undead Thralls",
          "description": "When you cast animate dead, you can target one additional corpse or pile of bones. Additionally, you can use animate dead as a bonus action."
        },
        {
          "level": 10,
          "name": "Inured to Undeath",
          "description": "You have resistance to necrotic damage, and your hit point maximum can't be reduced."
        },
        {
          "level": 14,
          "name": "Command Undead",
          "description": "You can use magic to bring undead under your control, even those created by other wizards. As an action, choose one undead that you can see within 60 feet of you. That creature must make a Charisma saving throw against your wizard spell save DC."
        }
      ]
    },
    "transmutation": {
      "name": "School of Transmutation",
      "description": "You are a student of spells that modify energy and matter. To you, the world is not a fixed thing, but eminently mutable, and you delight in being an agent of change. You wield the raw stuff of creation and learn to alter both physical forms and mental qualities. Your magic gives you the tools to become a smith on reality's forge.",
      "features": [
        {
          "level": 2,
          "name": "Transmutation Savant",
          "description": "The gold and time you must spend to copy a transmutation spell into your spellbook is halved."
        },
        {
          "level": 2,
          "name": "Minor Alchemy",
          "description": "You can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone, iron, copper, or silver, transforming it into a different one of those materials."
        },
        {
          "level": 6,
          "name": "Transmuter's Stone",
          "description": "You can spend 8 hours creating a transmuter's stone that stores transmutation magic. When you create the stone, choose the benefit from the following options: Darkvision, Maximize effect of one potion, Resistance to cold damage, Resistance to fire damage, Resistance to lightning damage, Resistance to poison damage, Swim speed equal to walking speed, or Toughness (increase hit points)."
        },
        {
          "level": 10,
          "name": "Shapechanger",
          "description": "You add polymorph and stone skin to your spellbook if they are not there already. You can cast polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower."
        },
        {
          "level": 14,
          "name": "Master Transmuter",
          "description": "You can use your action to consume the reserve of transmutation magic stored within your transmuter's stone in a single burst. When you do so, choose one of the following effects: Major Transformation, Panacea, Restore Life, or Restore Youth."
        }
      ]
    },
    "war-magic": {
      "name": "War Magic",
      "description": "A variety of arcane colleges specialize in training wizards for the perils of war. The tradition of War Magic blends principles of evocation and abjuration, teaching wizards to turn spells into weapons and to use their magic to bolster their own defenses.",
      "features": [
        {
          "level": 2,
          "name": "Arcane Deflection",
          "description": "You have learned to weave your magic to fortify yourself against harm. When you are hit by an attack, you can use your reaction to gain a +2 bonus to AC against that attack, potentially causing it to miss you."
        },
        {
          "level": 2,
          "name": "Tactical Wit",
          "description": "You can give yourself a bonus to your initiative rolls equal to your Intelligence modifier."
        },
        {
          "level": 6,
          "name": "Power Surge",
          "description": "You can store magical energy within yourself to later empower your damaging spells. In addition, as a bonus action, you can expend one use of your Arcane Surge to gain advantage on the next weapon attack roll you make on this turn."
        },
        {
          "level": 10,
          "name": "Durable Magic",
          "description": "Whenever you roll initiative and have no uses of Arcane Surge remaining, you regain one use."
        },
        {
          "level": 14,
          "name": "Deflecting Shroud",
          "description": "You can cause your Arcane Deflection to deflect a ray attack that targets only you and hit a creature of your choice within 60 feet of you, instead of you."
        }
      ]
    },
    "bladesinging": {
      "name": "Bladesinging",
      "description": "Bladesingers master a tradition of wizardry that incorporates swordplay and dance. Originally created by elves, this tradition has been adopted by non-elf practitioners.",
      "features": [
        {
          "level": 2,
          "name": "Bladesong",
          "description": "You can invoke a bladesong as a bonus action. While the bladesong is active, you gain the following benefits: You can move at double your speed, you have advantage on Acrobatics checks, you gain a bonus to your AC equal to your Intelligence modifier (minimum of +1), and your melee weapon attacks score a critical hit on a roll of 19 or 20."
        },
        {
          "level": 2,
          "name": "Training in War and Song",
          "description": "You gain proficiency with light armor, one type of one-handed melee weapon of your choice, and the Performance skill if you don't already have it."
        },
        {
          "level": 6,
          "name": "Extra Attack",
          "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn while your bladesong is active."
        },
        {
          "level": 10,
          "name": "Bladesong Attack",
          "description": "You can expend one use of your Bardic Inspiration to cause the weapon to deal an extra 1d6 force damage to the target. You can use this feature before or after making the attack roll."
        },
        {
          "level": 14,
          "name": "Song of Defense",
          "description": "When you take damage while your bladesong is active, you can use your reaction to expend one use of your Bardic Inspiration, roll the Bardic Inspiration die, and reduce the damage by the number rolled plus your Intelligence modifier."
        }
      ]
    },
    "order-of-scribes": {
      "name": "Order of Scribes",
      "description": "Magic of the book is an esoteric practice that produces tangible results. The physical books created by this tradition's wizards are prized and feared in equal measure.",
      "features": [
        {
          "level": 2,
          "name": "Wizardly Quill",
          "description": "As a bonus action, you can magically create a Tiny quill in your free hand. The magic quill has the following properties: The quill doesn't require ink. When you write with it, it produces ink in a color of your choice on the writing surface. The time you must spend to copy a spell into your spellbook equals 2 minutes per spell level if you use the quill for the transcription."
        },
        {
          "level": 2,
          "name": "Awakened Spellbook",
          "description": "You've awakened your spellbook with protective spells. When you cast a wizard spell with a spell slot, you can simultaneously replace its damage type with a type that appears in another spell in your spellbook, using the same spell slot."
        },
        {
          "level": 6,
          "name": "Manifest Mind",
          "description": "You can conjure forth the mind of your Awakened Spellbook. As an action, you can cause the mind to manifest as a Tiny spectral object, hovering in an unoccupied space of your choice within 60 feet of you. The spectral mind is intangible and doesn't occupy its space."
        },
        {
          "level": 10,
          "name": "Master Scrivener",
          "description": "When you damage a creature with a cantrip, you can also reduce its speed by 10 feet until the start of your next turn."
        },
        {
          "level": 14,
          "name": "One with the Word",
          "description": "Your connection to your Awakened Spellbook has become so profound that your soul has become entwined with it. While the book is on the same plane of existence as you, you can speak its command word as an action to instantly teleport to an unoccupied space within 15 feet of it."
        }
      ]
    },
    "chronurgy-magic": {
      "name": "Chronurgy Magic",
      "description": "Focusing on the manipulation of time, those who follow the Chronurgy tradition learn to alter the pace of reality to their liking.",
      "features": [
        {
          "level": 2,
          "name": "Chronal Shift",
          "description": "You can magically exert limited control over the flow of time around a creature. As a reaction, after a creature you can see within 30 feet of you makes an attack roll, an ability check, or a saving throw, you can force the creature to reroll. You make this decision after you see whether the roll succeeds or fails."
        },
        {
          "level": 2,
          "name": "Temporal Awareness",
          "description": "You can't be surprised while you are conscious."
        },
        {
          "level": 6,
          "name": "Momentary Stasis",
          "description": "As an action, you can magically force a Large or smaller creature you can see within 60 feet of you to make a Constitution saving throw against your spell save DC. On a failed save, the creature is encased in a field of magical force until the start of your next turn or until the creature takes any damage."
        },
        {
          "level": 10,
          "name": "Arcane Abeyance",
          "description": "When you cast a spell using a spell slot of 4th level or lower, you can condense the spell's magic into a mote. The spell is frozen in time at the moment of casting and held within a gray bead for 1 hour. This bead is a Tiny object with AC 15 and 1 hit point, and it is immune to poison and psychic damage."
        },
        {
          "level": 14,
          "name": "Convergent Future",
          "description": "You can peer through possible futures and magically pull the one you want into existence, ensuring a particular outcome. When you or a creature you can see within 60 feet of you makes an attack roll, an ability check, or a saving throw, you can use your reaction to ignore the die roll and decide whether the number rolled is the minimum needed to succeed or one less than that number (your choice)."
        }
      ]
    },
    "graviturgy-magic": {
      "name": "Graviturgy Magic",
      "description": "Studying the Graviturgy tradition means seeking to understand and master the invisible forces that move the universe, especially gravity.",
      "features": [
        {
          "level": 2,
          "name": "Adjust Density",
          "description": "As an action, you can magically alter the weight of one object or creature you can see within 30 feet of you. The object or creature must be Large or smaller. The target's weight is doubled or halved for 1 minute, or until you cast this spell again."
        },
        {
          "level": 6,
          "name": "Gravity Well",
          "description": "When you cast a spell on a creature, you can move the target 5 feet to an unoccupied space of your choice if the target is willing to move, the spell hits it with an attack, or it fails a saving throw against the spell."
        },
        {
          "level": 10,
          "name": "Violent Attraction",
          "description": "When another creature that you can see within 60 feet of you hits with a weapon attack, you can use your reaction to attempt to pull the weapon away. The attacker must succeed on a Strength saving throw, or it drops the weapon at its feet."
        },
        {
          "level": 14,
          "name": "Event Horizon",
          "description": "As an action, you select a point within 60 feet of you. For 1 minute, whenever a creature enters the area within 30 feet of that point or starts its turn there, it must make a Dexterity saving throw. On a failed save, the creature is pulled 10 feet toward the point before taking actions."
        }
      ]
    }
  }
}
